Задание 1. 

1. Первое на что бы я обратила внимание, на количество отказов, т.е. сколько человек заходит на сайт, собирает покупки в корзину, но до оформления заказа не доходит, изучила бы возможные проблемы, возникающие в процессе оформления или оплаты.

2. Так же, количечество людей, кто сразу покидает сайт, возможно неудобное меню, либо неправильно распределен товар, сложности с поиском на сайте и т.п.

3. Время проведенное на сайте, что будет означать насколько удобен интерфейс сайта.

4. Так же, проанализировала бы, сколько человек после первого заказа обращаются снова, что будет показателем успешной и качественной доставки до клиента.

5. Устройство, с которого был осуществелен заказ. Если большинство - это мобильный телефон, то возможно подумать об оптимизации именно мобильной версии.

Задание 2.

In [10]:
import sqlalchemy
import psycopg2
conn = 'postgresql+psycopg2://analytics:HRanalytics@rc1c-fhrb9f1e0l9g611h.mdb.yandexcloud.net:6432/hr-analytics'
engine = sqlalchemy.create_engine(conn)
connect = engine.connect()

In [31]:
df = pd.read_sql("""select store_id, count(total_quantity) as количество, city
from orders
inner join stores on orders.store_id = stores.id
group by store_id, city
order by  количество, city 
limit 11""", connect)
df.head(10)

# 10 магазинов с наименьшим количеством единиц товара, что может быть вызвано, например, плохим ассортиментом.

   store_id  количество  city
0       179           1     1
1       317           3     1
2       254         193     5
3       248         221     1
4       259         228    10
5       252         325     5
6        57         358     1
7       262         376     1
8       245         421     1
9       235         439    13

In [21]:
# Можно проверить, есть ли связь между id адреса доставки и количеством отмен заказа:
df = pd.read_sql("""select count(ship_address_id) as ship_address_id, shipped_at, state
from orders
where state = 'canceled'
group by ship_address_id, shipped_at, state""", connect)
df.head()
# Но как видно из полученных вычеслений, отмененные заказы единичны, 
# т.е. не зависят от адреса доставки или от удаленности.

   ship_address_id          shipped_at     state
0                1 2018-08-30 12:53:16  canceled
1                1 2018-09-28 15:12:57  canceled
2                1 2018-11-16 11:43:38  canceled
3                1 2018-12-28 15:34:58  canceled
4                1 2018-12-28 15:41:13  canceled

In [22]:
# Мы можем вычеслить магазины с самыми длительными доставками:
df = pd.read_sql("""select store_id, CAST((ends_at-starts_at) as time(0))
from delivery_windows
group by store_id, time
order by time desc""", connect)
df.head()

   store_id      time
0        62  11:00:00
1        63  11:00:00
2        92  10:00:00
3         2  10:00:00
4       105  08:00:00

In [25]:
# Так же, мы моджем посмотреть в каких городах и какого ритейлера находятся магазины с самой длительной доставкой.
df = pd.read_sql("""select distinct (store_id), CAST((ends_at-starts_at) as time(0)), city, retailer_id
from delivery_windows
join stores on delivery_windows.store_id = stores.id 
order by time desc""", connect)
df.head()

   store_id      time  city  retailer_id
0        62  11:00:00     2            1
1        63  11:00:00     2            1
2         2  10:00:00     1            1
3        92  10:00:00     2           15
4         1  08:00:00     1            1

In [26]:
# Можно посмотреть как часто происходила замена того или иного товара, то есть возможно что приходилось регулярно 
# заменять какой-то определенный товар
df = pd.read_sql("""select item_id, count(item_id)as количество, order_id
from replacements
group by item_id, order_id
order by количество""", connect)
df.head()
# В данном случае, замены товара носили единичный случай.

    item_id  количество  order_id
0  82650299           1   5093074
1  82650317           1   5081169
2  82650329           1   5071570
3  82650339           1   5097476
4  82650357           1   5093894

In [27]:
#  Аналогично посмотрим и по отмененным товарам.
df = pd.read_sql("""select item_id, count(item_id)as количество, order_id
from cancellations
group by item_id, order_id
order by количество desc""", connect)
df.head()
# Так же можно увидеть, что никакой взаимосвязи нет, отмены носят единичный характер.

    item_id  количество  order_id
0  68106058           1   3860719
1  68106090           1   4359354
2  68106103           1   4359354
3  68106104           1   4359354
4  68106166           1   4095172

In [30]:
# По отмененным и замененным товарам можно отметить, что товар, который был отменен, в итоге был отменен 
# не окончательно, клиент брал товар взамен отмененного.
df = pd.read_sql("""select cancellations.order_id as отмена,  replacements.order_id as замена, cancellations.item_id , replacements.item_id
from cancellations
inner join replacements on cancellations.order_id = replacements.order_id""", connect)
df.head(10)

   отмена  замена  item_id  item_id
0  484744  484744  5395137  5395166
1  485318  485318  5402880  5404957
2  489637  489637  5478964  5479349
3  489637  489637  5478964  5464815
4  489637  489637  5472773  5479349
5  489637  489637  5472773  5464815
6  489637  489637  5464799  5479349
7  489637  489637  5464799  5464815
8  490794  490794  5482899  5482823
9  490794  490794  5482899  5483677